{
  "common": {
    "search": "Көрікті жерлерді іздеу...",
    "menu": "Мәзір",
    "noResults": "Көрікті жерлер табылмады",
    "readMore": "Толығырақ",
    "showOnMap": "Картадан көрсету"
  },
  "menuItems": {
    "historicalFacts": "Тарихи деректер",
    "regionInfo": "Аймақ туралы",
    "settings": "Баптаулар"
  },
  "screens": {
    "home": {
      "title": "TourGid"
    },
    "attractionDetail": {
      "title": "Толығырақ",
      "historicalInfo": "Тарихи анықтама",
      "workingHours": "Жұмыс уақыты",
      "contacts": "Байланыс",
      "weekdays": "Жұмыс күндері",
      "weekend": "Демалыс күндері",
      "dayOff": "Демалыс күні"
    },
    "historicalFacts": {
      "title": "Тарихи деректер"
    },
    "settings": {
      "title": "Баптаулар"
    },
    "regionInfo": {
      "title": "Аймақ туралы"
    },
    "map": {
      "title": "Карта"
    }
  },
  "interests": {
    "music": "Музыка",
    "history": "Тарих",
    "nature": "Табиғат",
    "culture": "Мәдениет",
    "architecture": "Сәулет өнері"
  },
  "attractions": {
    "abdullinMuseum": {
      "name": "Абдуллин ағайындылар атындағы көркемөнер мұражайы",
      "description": "Шығыс Қазақстандағы ең ірі көркемөнер коллекциясы"
    },
    "jasytarPark": {
      "name": "Жастар паркі",
      "description": "Аттракциондар мен жасыл аймақтары бар орталық демалыс паркі"
    },
    "svyatoTroitskyMonastery": {
      "name": "Свято-Троицкий монастырь",
      "description": "XIX ғасырдағы тарихи православ монастырі"
    },
    "bukhtarmaReservoir": {
      "name": "Бұқтырма су қоймасы",
      "description": "Қазақстанның ең ірі су қоймаларының бірі"
    },
    "irtyshEmbankmentUsk": {
      "name": "Ертіс жағалауы",
      "description": "Серуендеуге арналған жақсы жабдықталған жағалау"
    },
    "abayParkShymkent": {
      "name": "Абай атындағы орталық парк",
      "description": "Хайуанаттар бағы мен ботаникалық бақшасы бар Шымкенттің ең ірі паркі"
    },
    "karavanSaraiMuseum": {
      "name": "'Қарауан-сарай' мұражайы",
      "description": "Ұлы Жібек жолына арналған тарихи кешен"
    },
    "nurAstanaMosqueShymkent": {
      "name": "Нұр-Астана мешіті",
      "description": "Оңтүстік Қазақстанның рухани орталығы - заманауи мешіт"
    },
    "karatauMountain": {
      "name": "Қаратау жотасы",
      "description": "Көрікті көріністері мен серуен маршруттары бар тау жотасы"
    },
    "kentauCanyons": {
      "name": "Кентау каньондары",
      "description": "Қызыл жартастары бар көрікті каньондар"
    },
    "baiterek": {
      "name": "Бәйтерек",
      "description": "Астананың басты белгісі - қалаға панорамалық көрініс"
    },
    "hazretSultanMosque": {
      "name": "Хазрет Сұлтан мешіті",
      "description": "Орталық Азиядағы ең ірі мешіттердің бірі"
    },
    "palaceOfPeace": {
      "name": "Бейбітшілік пен келісім сарайы",
      "description": "Норман Фостердің жобасы бойынша салынған бірегей пирамида"
    },
    "khanShatyr": {
      "name": "Хан Шатыр",
      "description": "Әлемдегі ең үлкен шатыр - сауда және ойын-сауық орталығы"
    },
    "nationalMuseumKz": {
      "name": "Қазақстан Ұлттық мұражайы",
      "description": "Елдің ең үлкен мұражайы - бай коллекциясы бар"
    },
    "beketAtaMosque": {
      "name": "Бекет-Ата жерасты мешіті",
      "description": "Үңгірдегі киелі зиярат орны"
    },
    "boszhiraCanyon": {
      "name": "Бозжыра каньоны",
      "description": "Ақ бор жартастары бар Марс пейзаждары"
    },
    "sherkalaМountain": {
      "name": "Шеркала тауы",
      "description": "Киіз үй тәрізді тау - 'Арыстан тауы'"
    },
    "aktauBeach": {
      "name": "Ақтау жағажайлары",
      "description": "Каспий теңізі жағалауындағы құмды жағажайлар"
    },
    "mangystauMuseum": {
      "name": "Маңғыстау тарихи-өлкетану мұражайы",
      "description": "Маңғыстау өңірінің тарихы мен мәдениеті"
    }
  },
  "routes": {
    "culturalUstKamenogorsk": {
      "name": "Өскемен мәдени мұрасы",
      "description": "Мұражайлар, монастырь және қаланың орталық паркі"
    },
    "natureEastKazakhstan": {
      "name": "Шығыс Қазақстан табиғаты",
      "description": "Бұқтырма су қоймасы және Ертіс жағалауы"
    },
    "historicalShymkent": {
      "name": "Тарихи Шымкент",
      "description": "Ұлы Жібек жолының тарихы және рухани орталықтар"
    },
    "mountainsOfShymkent": {
      "name": "Шымкент таулары",
      "description": "Қаратау жотасы бойынша серуен және көрікті каньондар"
    },
    "modernAstana": {
      "name": "Заманауи Астана",
      "description": "Қазақстан астанасының сәулеттік белгілері"
    },
    "spiritualAstana": {
      "name": "Рухани Астана",
      "description": "Хазрет Сұлтан мешіті және Ұлттық мұражай"
    },
    "astanaInOneDay": {
      "name": "Бір күнде Астана",
      "description": "Астананың барлық басты көрікті жерлері"
    },
    "coastalAktau": {
      "name": "Жағалаудағы Ақтау",
      "description": "Каспий жағажайлары және өңірдің тарихи мұражайы"
    },
    "mangystauWonders": {
      "name": "Маңғыстау кереметтері",
      "description": "Эпикалық саяхат: Бекет-Ата, Шеркала, Бозжыра"
    }
  },
  "historicalFacts": {
    "pavlodarFoundation": {
      "title": "Коряковский қорғанының негізі",
      "description": "1720 жылы Ертіс жағасында Коряковский қорғаны салынды, Павлодар тарихының басталуы.",
      "fullDescription": "1720 жылы Ертіс өзенінің жағасында Коряковский қорғаны салынды, оның басты міндеті Коряковское көлінің тұз кеніштерін қорғау болды. Бұл күн Павлодар қаласы тарихының басталуы саналады. Қорған Петр I жарлығымен Ресей империясының шығыс шекараларын нығайту шеңберінде салынды. Уақыт өте қорған казак станицасына, содан кейін Ресейден Орталық Азияға жол бойындағы ірі сауда орталығына айналды."
    },
    "cityStatus": {
      "title": "Қала мәртебесін алу",
      "description": "1861 жылы император II Александр жарлығымен станица Павлодар қаласына айналды.",
      "fullDescription": "1861 жылы император II Александр жарлығымен Коряковская станицасы Павлодар қаласына айналдырылды. Қаланың аты мұрагер Павелдің (II Александр ұлының) есімінен және 'дар' (сыйлық) сөзінен шыққан. Осылайша, атауды 'Павел сыйлығы' деп аударуға болады. Қала мәртебесін алу өңірдің экономикалық дамуына, халықтың көбеюіне және Павлодардың Ертістегі маңызды сауда орталығына айналуына ықпал етті."
    },
    "uskFortress": {
      "title": "Өскемен бекінісі",
      "description": "1720 жылы Ресейдің оңтүстік шекараларын қорғау үшін Өскемен бекінісі салынды.",
      "fullDescription": "Өскемен 1720 жылдың 1 мамырында Ертіс пен Ұлба өзендерінің қосылысында әскери бекініс ретінде салынды. Бекіністі Петр I жарлығымен майор И.М. Лихарев экспедициясы салды, оның мақсаты жоңғарлардың шабуылынан қорғау және Орталық Азияға дейінгі сауда жолдарын бақылау болды. Қаланың аты Каменка өзенінің аузына (қазіргі Ұлба) орналасуынан шыққан. Бекініс Ресей империясының Алтайдағы маңызды форпосы және өңірдің кен өндіру өнеркәсібін дамыту орталығына айналды."
    },
    "uskRegionalCenter": {
      "title": "Облыс орталығы",
      "description": "1868 жылы Өскемен округ қаласы мәртебесін алды.",
      "fullDescription": "1868 жылы Өскемен Семей облысының құрамында округ қаласы мәртебесін алды. Қала Ресейді Моңғолия мен Қытаймен байланыстыратын сауда және әкімшілік орталық ретінде дамыды. XIX ғасырдың соңында қала арқылы маңызды сауда жолы өтті, кен өндіру және өңдеу өнеркәсібі дамыды. 1932 жылы Өскемен Шығыс Қазақстан облысының орталығы болды. Кеңестік кезеңде қала түсті металлургия, энергетика және машина жасау саласының ірі өнеркәсіп орталығына айналды."
    },
    "shymkentOrigin": {
      "title": "Ежелгі Шымкент Жібек жолында",
      "description": "Шымкент XII ғасырда Ұлы Жібек жолындағы бекініс ретінде пайда болды.",
      "fullDescription": "Шымкент қаласы (бұрынғы Чимкент) XII ғасырға дейінгі ежелгі тарихқа ие. Ол Ұлы Жібек жолының бір тармағындағы бекініс ретінде салынды. Қала аты түркі тілінен 'шым кент' - 'шым қаласы' немесе 'шөп төбелі қала' деп аударылады. Орта ғасырларда қала маңызды сауда орталығы және Орталық Азияны Қытай мен Еуропамен байланыстыратын керуен жолдарының түйіні болды. Сауда жолдарының қиылысындағы стратегиялық орналасуы қолөнер, сауда және мәдениеттің дамуына ықпал етті."
    },
    "shymkentCity": {
      "title": "Республикалық маңызды қала",
      "description": "2018 жылы Шымкент республикалық маңызды қала мәртебесін алды.",
      "fullDescription": "2018 жылдың 19 маусымында Шымкент Алматы мен астанадан кейінгі үшінші қала ретінде республикалық маңызды қала мәртебесін алды. Бұл шешім Қазақстанның оңтүстігіндегі ең ірі қаланың әлеуметтік-экономикалық дамуын жеделдету үшін қабылданды. Шымкент Оңтүстік Қазақстан облысының құрамынан шығып, орталық үкіметке тікелей бағынышты болды. Қала халқы 1 миллион адамнан асты. Бүгінгі Шымкент - қазіргі заманғы инфрақұрылымы бар жылдам дамып келе жатқан қала, ірі өнеркәсіп, сауда және мәдениет орталығы."
    },
    "astanaFoundation": {
      "title": "Ақмола бұйрығы",
      "description": "1830 жылы болашақ астананың негізін қалаған Ақмола бұйрығы құрылды.",
      "fullDescription": "Астана тарихы 1830 жылы Көкшетаудан Семейге дейінгі керуен жолындағы казак бекінісі - Ақмола бұйрығы құрылған кезден басталады. Ақмолинск қалалық мәртебесін 1862 жылы алды. 1868 жылдан бастап қала Ақмола облысының орталығы болды. 'Ақмола' (Ақмола) аты қазақшадан 'ақ мола' немесе 'ақ молшылық' деп аударылады. Кеңестік кезеңде қала Целиноград (1961-1992) деп аталып, тың игеру орталығына айналды. Бұл Қазақ ССР-нің ірі өнеркәсіп және ауыл шаруашылығы орталығы болды."
    },
    "astanaCapital": {
      "title": "Қазақстанның жаңа астанасы",
      "description": "1997 жылы астана Алматыдан Ақмолаға (Астанаға) көшірілді.",
      "fullDescription": "1997 жылдың 10 желтоқсанында Тұңғыш Президент Нұрсұлтан Назарбаевтың бастамасымен Қазақстанның астанасы Алматыдан Ақмолаға көшірілді. 1998 жылы қала Астана (қазақша 'астана') деп аталды. Астананы көшіру стратегиялық себептермен: орталықтағы орналасу, даму әлеуеті, өңірлер арасындағы тепе-теңдікті жақсарту мақсатында жасалды. 25 жылда Астана бірегей сәулетімен, халықаралық саяси және іскерлік орталығымен ультразаманауи мегаполиске айналды. 2019-2022 жылдары қала Нұр-Сұлтан деп аталды. Бүгінгі Астана - Қазақстанның тәуелсіздігі мен гүлденуінің белгісі."
    },
    "aktauFoundation": {
      "title": "Атомшылар қаласы Шевченко",
      "description": "1963 жылы атом өнеркәсібі үшін база ретінде Шевченко қаласы (қазіргі Ақтау) құрылды.",
      "fullDescription": "Ақтау 1963 жылы Шевченко қаласы ретінде - атом өнеркәсібі қызметкерлері үшін жабық қала ретінде құрылды. Қала өңірді электрмен қамтамасыз еткен және қала қажеттіліктері үшін теңіз суын тұзсыздандырған әлемдегі алғашқы БН-350 өнеркәсіптік жылдам нейтронды реакторға қызмет көрсету үшін салынды. Ақтау Каспий теңізінің тұзсызданған суымен толық қамтамасыз етілген әлемдегі жалғыз қала болды. Қала Каспий жағалауындағы шөл жерде салынып, Маңғышлақты дамытудың форпосына айналды. Қала сәулеті кеңестік модернизмді көрсетті: кең даңғылдар, көп қабатты тұрғын үйлер, көп көгалдандыру."
    },
    "aktauRename": {
      "title": "Ақтау деп өзгерту",
      "description": "1991 жылы Шевченко қаласы Ақтау деп өзгертілді.",
      "fullDescription": "1991 жылы Қазақстан тәуелсіздік алғаннан кейін Шевченко қаласы Маңғышлақ түбегіндегі бор тауларының атауы бойынша Ақтау (Ақтау) деп өзгертілді, бұл қазақшадан 'ақ тау' деп аударылады. Өзгерту қазақ тамырлары мен дәстүрлеріне қайта оралуды білдірді. Реактор 1999 жылы жабылғаннан кейін қала мұнай-газ өнеркәсібіне бағдарланып, Каспийдің қазақстандық жағалауындағы ең ірі портқа айналды. Бүгінгі Ақтау - Маңғыстау облысының әкімшілік орталығы, маңызды көлік-логистика орталығы, бірегей табиғи ландшафттары бар мұнай өндіру және туризм орталығы."
    }
  }
} 