{
  "common": {
    "search": "Поиск достопримечательностей...",
    "menu": "Меню",
    "noResults": "Достопримечательности не найдены",
    "readMore": "Подробнее",
    "showOnMap": "Показать на карте",
    "loadingMap": "Загрузка карты..."
  },
  "menuItems": {
    "historicalFacts": "Исторические факты",
    "regionInfo": "О Павлодарской области",
    "settings": "Настройки",
    "routes": "Маршруты"
  },
  "screens": {
    "home": {
      "title": "TourGid Павлодар"
    }, 
    "attractionDetail": {
      "title": "Подробнее",
      "historicalInfo": "Историческая справка",
      "workingHours": "Время работы",
      "contacts": "Контакты",
      "weekdays": "Будни",
      "weekend": "Выходные",
      "dayOff": "Выходной",
      "rating": "Рейтинг",
      "visitDuration": "Время посещения",
      "bestTimeToVisit": "Лучшее время",
      "accessibility": "Доступность",
      "tips": "Советы"
    },
    "historicalFacts": {
      "title": "История Павлодара"
    },
    "settings": {
      "title": "Настройки",
      "languageSection": "Язык",
      "themeSection": "Тема",
      "darkMode": "Темная тема"
    },
    "regionInfo": {
      "title": "О Павлодарской области",
      "links": "Полезные ссылки",
      "officialSite": "Официальный сайт",
      "touristPortal": "Туристический портал",
      "map": "Карта региона"
    },
    "map": {
      "title": "Карта"
    }
  },
  "interests": {
    "religion": "Религия",
    "history": "История",
    "nature": "Природа",
    "culture": "Культура",
    "architecture": "Архитектура",
    "recreation": "Отдых",
    "entertainment": "Развлечения",
    "family": "Семейный отдых",
    "education": "Образование",
    "sport": "Спорт",
    "scenic": "Живописные места",
    "wellness": "Оздоровление",
    "unique": "Уникальные места",
    "adventure": "Приключения"
  },
  "historicalFacts": {
    "pavlodarFoundation": {
      "title": "Основание Коряковского форпоста",
      "description": "В 1720 году на берегу Иртыша был основан Коряковский форпост, ставший началом истории Павлодара.",
      "fullDescription": "В 1720 году на берегу Иртыша был основан Коряковский форпост, главной задачей которого была охрана соляных промыслов на Коряковском озере. Эта дата считается началом истории города Павлодара. Форпост был построен по указу Петра I в рамках укрепления восточных границ Российской империи. Со временем форпост превратился в казачью станицу, а затем и в крупный торговый центр на пути из России в Среднюю Азию."
    },
    "cityStatus": {
      "title": "Присвоение статуса города",
      "description": "В 1861 году указом императора Александра II станица была преобразована в город Павлодар.",
      "fullDescription": "В 1861 году указом императора Александра II станица Коряковская была преобразована в город Павлодар. Название города произошло от имени наследника престола Павла (сына Александра II) и слова 'дар'. Таким образом, название можно перевести как 'дар (в честь) Павла'. Получение статуса города способствовало экономическому развитию региона, притоку населения и превращению Павлодара в важный торговый узел на Иртыше."
    },
    "virginLands": {
      "title": "Освоение целины",
      "description": "В 1954-1955 годах началось активное освоение целинных земель Павлодарской области.",
      "fullDescription": "В 1954-1955 годах в Казахстане развернулась программа освоения целинных и залежных земель. Павлодарская область стала одним из главных центров этой кампании. В регион прибыли тысячи людей из разных республик СССР - молодые специалисты, студенты, демобилизованные военные. Это кардинально изменило демографический состав населения. Было основано множество новых совхозов и поселков, а экономика региона стала ориентироваться на сельское хозяйство наряду с развивающейся промышленностью."
    },
    "industrialDevelopment": {
      "title": "Промышленное развитие",
      "description": "1960-1980 годы - эпоха превращения Павлодара в крупный индустриальный центр.",
      "fullDescription": "В 1960-1980 годы Павлодар превратился в один из крупнейших промышленных центров Казахстана. Были построены алюминиевый завод, нефтехимический комбинат, тракторный завод. Город стал важным центром энергетики благодаря строительству Павлодарской ГРЭС. Население города выросло в несколько раз, была построена современная инфраструктура. Павлодар получил статус областного центра и стал одним из ключевых промышленных городов Казахской ССР."
    },
    "uskFortress": {
      "title": "Усть-Каменная крепость",
      "description": "В 1720 году была основана Усть-Каменная крепость для защиты южных рубежей России.",
      "fullDescription": "Усть-Каменогорск был основан 1 мая 1720 года как военная крепость на слиянии рек Ульбы и Иртыша. Крепость была построена экспедицией майора И.М. Лихарева по указу Петра I для защиты от набегов джунгар и контроля над торговыми путями в Среднюю Азию. Название города происходит от расположения у устья реки Каменки (ныне Ульба). Крепость стала важным форпостом Российской империи на Алтае и центром развития горнорудной промышленности региона."
    },
    "uskRegionalCenter": {
      "title": "Областной центр",
      "description": "В 1868 году Усть-Каменогорск получил статус окружного города.",
      "fullDescription": "В 1868 году Усть-Каменогорск получил статус окружного города в составе Семипалатинской области. Город развивался как торговый и административный центр, связывающий Россию с Монголией и Китаем. В конце XIX века через город проходил важный торговый путь, развивалась горнодобывающая и перерабатывающая промышленность. В 1932 году Усть-Каменогорск стал центром Восточно-Казахстанской области. В советский период город превратился в крупный промышленный центр цветной металлургии, энергетики и машиностроения."
    },
    "shymkentOrigin": {
      "title": "Древний Чимкент на Шелковом пути",
      "description": "Шымкент возник как крепость на Великом Шелковом пути в XII веке.",
      "fullDescription": "Город Шымкент (ранее Чимкент) имеет древнюю историю, восходящую к XII веку. Он был основан как крепость на одном из ответвлений Великого Шелкового пути. Название города происходит от тюркского 'шым кент' - 'город дерна' или 'город с травяными крышами'. В средние века город был важным торговым центром и узлом караванных путей, связывающих Среднюю Азию с Китаем и Европой. Стратегическое расположение на пересечении торговых путей способствовало развитию ремесел, торговли и культуры."
    },
    "shymkentCity": {
      "title": "Город республиканского значения",
      "description": "В 2018 году Шымкент получил статус города республиканского значения.",
      "fullDescription": "19 июня 2018 года Шымкент получил статус города республиканского значения, став третьим городом Казахстана с таким статусом после Алматы и столицы. Это решение было принято для ускорения социально-экономического развития крупнейшего города юга Казахстана. Шымкент выделился из состава Южно-Казахстанской области и получил прямое подчинение центральному правительству. Население города превысило 1 миллион человек. Сегодня Шымкент - динамично развивающийся город с современной инфраструктурой, крупный промышленный, торговый и культурный центр."
    },
    "astanaFoundation": {
      "title": "Акмолинский приказ",
      "description": "В 1830 году был основан Акмолинский приказ, положивший начало будущей столице.",
      "fullDescription": "История Астаны началась в 1830 году, когда был основан Акмолинский приказ - казачье укрепление на караванном пути из Кокшетау в Семипалатинск. Статус города Акмолинск получил в 1862 году. С 1868 года город стал центром Акмолинской области. Название 'Акмола' (Ақмола) переводится с казахского как 'белая могила' или 'белое изобилие'. В советский период город был переименован в Целиноград (1961-1992) и стал центром освоения целинных земель. Это был крупный индустриальный и сельскохозяйственный центр Казахской ССР."
    },
    "astanaCapital": {
      "title": "Новая столица Казахстана",
      "description": "В 1997 году столица была перенесена из Алматы в Акмолу (Астану).",
      "fullDescription": "10 декабря 1997 года по инициативе Первого Президента Нурсултана Назарбаева столица Казахстана была перенесена из Алматы в Акмолу. В 1998 году город был переименован в Астану ('столица' на казахском). Перенос столицы был вызван стратегическими соображениями: более центральным расположением, большим потенциалом для развития, улучшением баланса между регионами. За 25 лет Астана превратилась в ультрасовременный мегаполис с уникальной архитектурой, международный политический и деловой центр. В 2019-2022 годах город назывался Нур-Султан. Сегодня Астана - символ независимости и процветания Казахстана."
    },
    "aktauFoundation": {
      "title": "Город атомщиков Шевченко",
      "description": "В 1963 году был основан город Шевченко (ныне Актау) как база для атомной промышленности.",
      "fullDescription": "Актау был основан в 1963 году как город Шевченко - закрытый город для работников атомной промышленности. Город строился для обслуживания первого в мире промышленного реактора на быстрых нейтронах БН-350, который обеспечивал регион электричеством и опреснял морскую воду для нужд города. Актау стал единственным в мире городом, полностью обеспечивавшимся опресненной водой Каспийского моря. Город строился в пустынной местности на побережье Каспия и стал форпостом развития Мангышлака. Архитектура города отражала советский модернизм: широкие проспекты, многоэтажные жилые дома, обилие зелени."
    },
    "aktauRename": {
      "title": "Переименование в Актау",
      "description": "В 1991 году город Шевченко был переименован в Актау.",
      "fullDescription": "В 1991 году, после обретения Казахстаном независимости, город Шевченко был переименован в Актау (Ақтау), что в переводе с казахского означает 'белая гора', по названию меловых гор на полуострове Мангышлак. Переименование символизировало возвращение к казахским корням и традициям. После закрытия реактора в 1999 году город переориентировался на нефтегазовую индустрию, став крупнейшим портом на казахстанском побережье Каспия. Сегодня Актау - административный центр Мангистауской области, важный транспортно-логистический узел, центр нефтедобычи и туризма с уникальными природными ландшафтами."
    }
  },
  "regionInfo": {
    "description": "Павлодарская область расположена в северо-восточной части Казахстана на берегу реки Иртыш. Регион известен своей богатой историей, развитой промышленностью и природными достопримечательностями.",
    "population": "Население области составляет около 750 000 человек разных национальностей.",
    "climate": "Климат резко континентальный: жаркое сухое лето (+35°C) и холодная зима до -40°C.",
    "economy": "Основой экономики региона являются металлургия, энергетика, машиностроение, нефтехимия и сельское хозяйство.",
    "geography": "Территория преимущественно равнинная, часть Западно-Сибирской низменности. На востоке располагаются отроги Алтайских гор. Главная река - Иртыш.",
    "culture": "Богатое культурное наследие, сочетающее казахские традиции и влияние русской культуры. Родина многих выдающихся деятелей литературы и искусства.",
    "nature": "Уникальная природа: от степей до горных массивов, соленые озера, первый национальный парк Казахстана - Баянаул."
  },
  "attractions": {
    "abdullinMuseum": {
      "name": "Музей изобразительных искусств им. братьев Абдуллиных",
      "description": "Крупнейшая художественная коллекция Восточного Казахстана"
    },
    "jasytarPark": {
      "name": "Парк Жастар",
      "description": "Центральный парк отдыха с аттракционами и зелеными зонами"
    },
    "svyatoTroitskyMonastery": {
      "name": "Свято-Троицкий монастырь",
      "description": "Исторический православный монастырь XIX века"
    },
    "bukhtarmaReservoir": {
      "name": "Бухтарминское водохранилище",
      "description": "Одно из крупнейших водохранилищ Казахстана с живописными видами"
    },
    "irtyshEmbankmentUsk": {
      "name": "Набережная Иртыша",
      "description": "Благоустроенная набережная для прогулок и отдыха"
    },
    "abayParkShymkent": {
      "name": "Центральный парк имени Абая",
      "description": "Крупнейший парк Шымкента с зоопарком и ботаническим садом"
    },
    "karavanSaraiMuseum": {
      "name": "Музей 'Караван-сарай'",
      "description": "Исторический комплекс, посвященный Великому Шелковому пути"
    },
    "nurAstanaMosqueShymkent": {
      "name": "Мечеть Нур-Астана",
      "description": "Современная мечеть - духовный центр Южного Казахстана"
    },
    "karatauMountain": {
      "name": "Хребет Каратау",
      "description": "Горный хребет с живописными видами и треккинг-маршрутами"
    },
    "kentauCanyons": {
      "name": "Кентауские каньоны",
      "description": "Живописные каньоны с красными скалами"
    },
    "baiterek": {
      "name": "Байтерек",
      "description": "Главный символ столицы с панорамным видом на город"
    },
    "hazretSultanMosque": {
      "name": "Мечеть Хазрет Султан",
      "description": "Одна из крупнейших мечетей в Центральной Азии"
    },
    "palaceOfPeace": {
      "name": "Дворец Мира и Согласия",
      "description": "Уникальная пирамида, проект Нормана Фостера"
    },
    "khanShatyr": {
      "name": "Хан Шатыр",
      "description": "Крупнейший шатер в мире - торговый и развлекательный центр"
    },
    "nationalMuseumKz": {
      "name": "Национальный музей Казахстана",
      "description": "Крупнейший музей страны с богатейшей коллекцией"
    },
    "beketAtaMosque": {
      "name": "Подземная мечеть Бекет-Ата",
      "description": "Священное место паломничества в пещере"
    },
    "boszhiraCanyon": {
      "name": "Каньон Босжира",
      "description": "Марсианские пейзажи с белыми скалами-останцами"
    },
    "sherkalaМountain": {
      "name": "Гора Шеркала",
      "description": "Гора в форме юрты - 'Львиная гора'"
    },
    "aktauBeach": {
      "name": "Пляжи Актау",
      "description": "Песчаные пляжи на побережье Каспийского моря"
    },
    "mangystauMuseum": {
      "name": "Мангистауский историко-краеведческий музей",
      "description": "История и культура региона Мангистау"
    }
  },
  "routes": {
    "culturalUstKamenogorsk": {
      "name": "Культурное наследие Усть-Каменогорска",
      "description": "Музеи, монастырь и центральный парк города"
    },
    "natureEastKazakhstan": {
      "name": "Природа Восточного Казахстана",
      "description": "Бухтарминское водохранилище и набережная Иртыша"
    },
    "historicalShymkent": {
      "name": "Исторический Шымкент",
      "description": "История Великого Шелкового пути и духовные центры"
    },
    "mountainsOfShymkent": {
      "name": "Горы Шымкента",
      "description": "Треккинг по хребту Каратау и живописным каньонам"
    },
    "modernAstana": {
      "name": "Современная Астана",
      "description": "Архитектурные символы столицы Казахстана"
    },
    "spiritualAstana": {
      "name": "Духовная Астана",
      "description": "Мечеть Хазрет Султан и Национальный музей"
    },
    "astanaInOneDay": {
      "name": "Астана за один день",
      "description": "Все главные достопримечательности столицы"
    },
    "coastalAktau": {
      "name": "Прибрежный Актау",
      "description": "Пляжи Каспия и музей истории региона"
    },
    "mangystauWonders": {
      "name": "Чудеса Мангистау",
      "description": "Эпическое путешествие: Бекет-Ата, Шеркала, Босжира"
    }
  }
} 